Revit 2027 API
Railing.GetSubelementOnLevel Method
 Gets the subelement on given level.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Subelement GetSubelementOnLevel(
	ElementId levelId
)
Public Function GetSubelementOnLevel (
	levelId As ElementId
) As Subelement
public:
Subelement^ GetSubelementOnLevel(
	ElementId^ levelId
)
member GetSubelementOnLevel :
        levelId : ElementId -> Subelement
Parameters
levelId ElementId
 The id of the level the railing subelement is placed on.
Return Value
Subelement
 The subelement in given level. null will be returned if railing has no subelements on given level.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The railing is not hosted by stairs in MultistoryStairs.
Remarks
 The method is valid only for railings hosted by stairs in MultistoryStairs. Input level should be a level of the railing stairs. See getStairsPlacementLevels method of MultistoryStairs.
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace